# 该代码用于展示对模拟数据进行重复测量方法分析，以及绘制柱状图
# 作者：潘晚坷
# https://github.com/HaiyangJin/BayesianLMM-cn

load("simulated_data.rdata")

df_simu = df_simu |> mutate(
  组别 = factor(group, labels = c("抑郁组","控制组")),
  图片类型 = factor(type, labels = c("中性图片","积极图片"))
)

# Two-way mixed ANOVA test
df_simu |> bruceR::MANOVA(
  subID = "subj",
  between = "组别",
  within = "图片类型",
  dv = "LPP",
  digits = 2,
  file = "重复测量方差分析结果.doc"
)

# ────────────────────────────────────
# "组别" "图片类型"   Mean    S.D.  n
# ────────────────────────────────────
# 抑郁组   中性图片 -2.708 (2.122) 40
# 抑郁组   积极图片  3.782 (2.560) 40
# 控制组   中性图片 -2.433 (1.968) 40
# 控制组   积极图片  4.073 (2.617) 40
# ────────────────────────────────────
# 
# ──────────────────────────────────────────────────────────────────────────────────
#                        MS   MSE df1 df2       F     p     η²p [90% CI of η²p]  η²G
# ──────────────────────────────────────────────────────────────────────────────────
# 组别                3.193 9.175   1  78   0.348  .557       .004 [.000, .059] .004
# 图片类型         1689.198 1.717   1  78 983.785 <.001 ***   .927 [.903, .942] .665
# 组别 * 图片类型     0.003 1.717   1  78   0.002  .969       .000 [.000, .000] .000
# ──────────────────────────────────────────────────────────────────────────────────

# 注意，正文中贝叶斯因子的分析结果与双因素混合设计方差分析的结果保持一致：
# 存在极强的证据支持LPP的波幅在图片类型之间存在差异，$BF_{01}$= 4.61e-17 < 100，对应 p < 0.001。
# 存在中等强度的证据支持组别组别间的LPP波幅不存在差异,$BF_{01}$= 8.90 > 3, 对应 p = 0.557。
# 有较强的证据表明，不存在组别和图片类型的交互作用，$BF_{01}$= 11.90 > 10, 对应 p = 0.969。

# plot & save
resfactor = 3
tiff(
  "fig1_barplot.tif", 
  width = 450 * resfactor,
  height = 411 * resfactor,
  res=72*resfactor,
  compression = "lzw"
  )

papaja::apa_barplot(
  df_simu,
  id = "subj",
  factors = c("图片类型", "组别"),
  dv = "LPP"
)

dev.off()


